{
  "associated_tools": [],
  "author_name": "M. Prager",
  "background_text": "A Stock Production Model Incorporating Covariates (ASPIC) is a non-equilibrium implementation of the well-known surplus production model of Schaefer (1954, 1957). ASPIC also fits the generalized stock production model of Pella and Tomlinson (1969) using the alternative parameterization of Fletcher (1978).The analytic engine for the ASPIC model, written by Dr. Michael Prager of the Southeast Fisheries Science Center, NMFS, incorporates several extensions to the classical stock-production models. ASPIC can fit data from up to 10 data series of fishery-dependent or fishery-independent indices, and uses bootstrapping to construct approximate nonparametric confidence intervals and to correct for bias. In addition, ASPIC can fit the model by varying the relative importance placed on yield versus measures of effort or indices of abundance. The model has been extensively reviewed and tested in the context of various applications to tuna stocks via the International Commission for the Conservation of Atlantic Tunas (ICCAT)  by Prager (1992 a, b). The model is more formally described in Prager (1994) and Quinn and Deriso (1999). Version 5.0 of ASPIC allows the user to estimate parameters by direct optimization, by grid search for model shape and by fixing model shape to fit the Fox (1970) model.ASPIC has been used as an assessment tool for swordfish (ICCAT), bluefin tuna (ICCAT), yellowtail flounder (NEFSC, NAFO), and fluke (NEFSC) among others.",
  "documentation_link": "",
  "download_app_link": "https://github.com/nmfs-fish-tools/ASPIC/releases/download/5.34.6/ASPIC534.zip",
  "fit_repo": "https://github.com/nmfs-fish-tools/ASPIC.git",
  "model_abbrev": "ASPIC",
  "tool_name": "A Stock Production Model Incorporating Covariates",
  "website_link": "https://www.mhprager.com/aspic.html",
  "online_app_link": "",
  "pdf_download": "",
  "references": [
    "Fox, W. W., Jr. 1971. Random variability and parameter estimation for the generalized production model. Fish. Bull. (U.S.) 69: 569–580.",
    "Pella, J. J. and P. K. Tomlinson 1969. A generalized stock production model. Bull. Inter-Am. Trop. Tuna Comm. 13: 419–496.",
    "Prager, M. H. 1992. ASPIC: A Surplus-Production Model Incorporating Covariates. Coll. Vol. Sci. Pap., Int. Comm. Conserv. Atl. Tunas (ICCAT) 28: 218–229.",
    "Prager, M. H. 1994. A suite of extensions to a nonequilibrium surplus-production model. Fish. Bull. (U.S.) 92: 374–389.",
    "Prager, M. H., C. Phillip Goodyear, and G. P. Scott. 1996. Application of a surplus-production model to a swordfish-like simulated stock with time-changing selectivity. Trans. AFS 125:729-740.",
    "Schaefer, M. B. 1957. A study of the dynamics of the fishery for yellowfin tuna in the eastern tropical Pacific Ocean. Inter-Am. Trop. Tuna Comm. Bull. 2: 247–268."
  ],
  "shields_badges":["https://www.repostatus.org/badges/latest/inactive.svg"],
  "active_development": false,
  "NOAA_internal": true,
  "version_number": "5.34.6",
  "release_badge":"nmfs-fish-tools/ASPIC",
  "toolbox_drawer": ["fisheries"],
  "keywords": ["Stock Assessment Model", "Surplus Production Model", "Legacy Tool", "Guided User Interface"]
}