{
  "associated_tools": [],
  "authors": "Seaver, A.",
  "maintainer_name": "orphaned", 
  "maintainer_email": "fisheries.toolbox@noaa.gov",
  "background_text": "The Collie-Sissenwine Analysis (CSA) model (sometimes called catch-survey analysis or the DeLury model) is a relatively simple two-stage stock assessment model that estimates abundance, fishing mortality and recruitment using total catch numbers and survey data (Collie and Sissenwine 1983; Conser 1995).  The “recruit” stage group consists of animals that recruit at, just before, or during the current time step.  The rest of the population comprises the “post-recruit” stage group.  The two stages may correspond to age groups, length groups or any other natural division (e.g. genders in hermaphroditic species).  Typically, both groups are assumed fully available to the fishery but this assumption can be relaxed in practice if fishing mortality rates are viewed as rates for fully recruited animals.  CSA (Version 4) was updated during 2013 and previous versions are no longer supported.  The update uses maximum likelihood rather than weighted sums of squares to estimate parameters.  The user must supply survey and year specific CVs that measure the precision of survey observations in likelihood calculations.  The updated version uses Baranov’s catch equation exclusively to simulate the population.  Pope’s approximation is no longer available because accuracy of the approximation degrades at high mortality rates.  As in previous versions, natural morality in each year is specified by the user and not estimable in the model.  The updated model does not allow for estimation of process errors.  Process errors tend to be difficult to estimate because they are typically aliased (cannot be distinguished from) time varying survey variances, natural mortality, recruitment and selectivity parameters already in the CSA model. Multiple surveys and survey types are now allowed, with time of the year that each survey occurred required.The calculation engine is written in AD Model Builder. The program is based on previous implementations DELPOP8 by Dr. Jeremy Collie at the University of Rhode Island, an APL version by Dr. Ramon Conser retired from SWFSC, and Fortran versions developed by the Population Dynamics Branch at NEFSC. ",
  "executable_link": "https://github.com/nmfs-fish-tools/CSA/releases/download/4.3/CSAV43.zip",
  "fit_repo": "https://github.com/nmfs-fish-tools/CSA.git",
  "tool_abbreviation": "CSA",
  "tool_name": "Collie-Sissenwine Analysis",
  "references": [
    "Collie, J. S. and M. P. Sissenwine, 1983. Estimating population size from relative abundance data measured with error. Can. J. Fish. Aquat. Sci., 40: 1871-1879."
  ],
  "software_badges":["https://www.repostatus.org/badges/latest/inactive.svg"],
  "active_development": false,
  "NOAA_internal": true,
  "static_version_number": "4.3",
  "uses_github_releases": false, 
  "release_badge":"nmfs-fish-tools/CSA",
  "toolbox_drawers": ["fisheries"],
  "keywords": ["Legacy Tool", "Stock Assessment Model", "Data Limited Method", "Guided User Interface"]
}