{
  "associated_tools": [],
  "authors": "J. Begley  D. Howell",
  "background_text": "Gadget is a flexible and powerful tool for creating ecosystem models. The program was developed for modelling marine ecosystems in a fisheries management and biology context, however there is nothing in the program that restricts it to fish, and models have been developed to examine marine mammal populations. Gadget has been used to investigate the population dynamics of many stocks and stock complexes in Icelandic waters, the Barents Sea, the North Sea and the Irish and Celtic Seas. Gadget can run complicated statistical ecosystem models, which take many features of the ecosystem into account. Gadget works by running an internal model based on many parameters, and then comparing the data from the output of this model to ''real'' data to get a goodness-of-fit likelihood score. The parameters can then be adjusted, and the model re-run, until an optimum is found, which corresponds to the model with the lowest likelihood score. For more information visit the website_link: https://imr.brage.unit.no/imr-xmlui/handle/11250/100625",

  "maintainer_email":"daniel.howell@imr.no",
  "documentation_link": "http://hdl.handle.net/11250/100625",
  "executable_link": "https://github.com/gadget-framework/gadget2/tags",
  "source_code_link": "https://github.com/gadget-framework/gadget2",
  "tool_abbreviation": "GADGET",
  "tool_name": "Globally applicable Area-Disaggregated General Ecosystem Toolbox",
  
  "website_link":"",
  "online_app_link": "",
  "pdf_download_link": "",
  "release_badge":"Hafro/gadget2",
  "references": ["Begley, J.S. and Howell, D. 2004. An overview of Gadget, the Globally applicable Area-Disaggregated General Ecosystem Toolbox. https://imr.brage.unit.no/imr-xmlui/handle/11250/100625"
  ],
    "active_development": true,
  "NOAA_internal": false,
  "software_badges":["https://www.repostatus.org/badges/latest/active.svg","https://img.shields.io/badge/platform-linux%20%7Cwin-lightgrey"],
  "static_version_number": "", 
  "toolbox_drawers": ["ecosystem", "fisheries"], 
  "keywords": ["Ecosystem", "Fisheries", "Multispecies Model"]
}
