{
  "authors": "Seaver, A.",
  "maintainer_name": "orphaned", 
  "maintainer_email": "fisheries.toolbox@noaa.gov",
  "background_text": "The Length Based Population Simulator (POPSIM-L) is a general data simulator designed to allow users to create populations with known underlying parameters and error structure. The program can be used to reveal the limitations of alternative estimation methods. These considerations are particularly important where model misspecification can lead to widely varying results. This simulator should have general utility for examining tradeoffs among model dimensionality, degree of fit, and generality.  The user specifies the coefficients of a von Bertalanffy growth equation.  This is applied in creating the initial population as normally distributed based on user specified proportion at age. The growth equation is also used in creating growth projection matrices for each age class.  All inputs are by sex.  Maturity and fishery selectivity are specified as length based functions.  The user specifies the fully recruited fishing mortality and natural mortality in each year of the model.  The population is developed using a length by age matrix for each year as a forward projecting model.  Mortality is applied and then growth projection.  The user may specify recruitment either as a vector of annual recruitment or Beverton-Holt, Ricker or Shepherd stock recruitment functions.  Alternatively, the user may specify either a 1-stage or 2-stage empirical cumulative distribution function.  The user may specify “surveys” of abundance based on applying log-normal error to the “true” populations in each year. Both “East Coast” (age-specific) and “West Coast” (age-aggregated) tuning indices can be created from the survey information. Catch samples are developed by random sampling at length and application of age-length keys.  Age-length keys can have user defined ageing imprecision applied.  The resulting stochastic realizations can be used to automatically generate datasets for input to VPA/ADAPT, CSA, ASPIC, ASAP, and SCALE.   Because the “surveys” with error are independent of how they are applied as indices of abundance in the estimation model, the same random error is being applied on each realization independent of the model being evaluated.  Thus, multiple models can be compared in their relative ability to recover the “true state of nature”.  POPSIM can be used to verify that the estimation models can recover the true parameters and the limitations of various models when their underlying assumptions are violated. The simulator is designed to allow users to rapidly compare the relative merits of alternative modeling approaches. The user interface allows for complete graphical analysis of input and output data.",
  "executable_link": "https://github.com/nmfs-fish-tools/POPSIM-L/releases/download/8.0.0/LENGTHPOPSIMV80.zip",
  "fit_repo": "https://github.com/nmfs-fish-tools/POPSIM-L.git",
  "tool_abbreviation": "POPSIM-L",
  "tool_name": "Length Population Simulator",
  "software_badges":["https://www.repostatus.org/badges/latest/inactive.svg"],
  "active_development": false,
  "noaa_internal": true,
  "static_version_number": "8.0.0",
  "release_badge":"nmfs-fish-tools/POPSIM-L",
  "toolbox_drawers": ["Fish and Fisheries"], 
  "uses_github_releases": false,
  "keywords": ["Simulation", "Guided User Interface", "Legacy Tool"]
}