{
  "active_development": true,
  "tool_name": "Productivity and Susceptibility Analysis (Shiny Version)",
  "tool_abbreviation": "PSA",
  "authors": "Nathan Vaughan, Jason Cope",
  "noaa_internal": true,
  "maintainer_name": "Nathan Vaughan",
  "maintainer_email": "nathan.vaughan@noaa.gov",
  "background_text": "Productivity-Susceptibility Analysis (PSA) is a semi-quantitative and rapid risk assessment approach described by Patrick et al (2009) that relies on the life history characteristics of a stock (i.e., productivity) and its susceptibility to the fishery in question to estimate its expected vulnerability to depletion. First used to classify differences in bycatch sustainability in the Australian prawn fishery in 2001, this assessment has a long history of use in evaluating fisheries and is recommended by several organizations and work groups as a reasonable approach for determining risk. The productivity and susceptibility of a stock is determined using scores ranging from 1 (low) to 3 (high) for a standardized set of attributes related to each index (productivity = 10; susceptibility = 12). When scoring these attributes, the original Patrick et al approach utilized a single score value, data quality rating, and relative weight for each attribute which were combined to calculate single productivity and susceptibility values for each species. Productivity and susceptibility are used to calculate a single vulnerability score for each stock (vulnerability=sqrt((3-productivity)^2 +(susceptibility-1)^2)). Stocks that receive a low productivity score and high susceptibility score are considered to be at a high risk of becoming depleted, while stocks with a high productivity score and low susceptibility score are considered to be at a low risk of becoming depleted. This tool is an R-Shiny application developed to perform a stochastic Productivity-Susceptability risk analysis. It extends the existing methodology of Patrick et al (2009) by providing the ability to assign a relative weight to each score for each attribute rather than a single value. Bootstrap resampling of scores based on their relative weights is used to define productivity, susceptibility, and vulnerability likelihood distributions. This alternate methodology and shiny application were developed by Dr Nathan Vaughan of Vaughan Analytics supporting NOAA's Southeast Fisheries Science Center in collaboration with Dr Jason Cope of NOAA's Northwest Fisheries Science Center. ",
  "citation": "https://github.com/nathanvaughan1/PSA",
  "online_app_link": "https://connect.fisheries.noaa.gov/psa/",
  "source_code_link": "https://github.com/nathanvaughan1/PSA",
  "toolbox_drawers": ["Fish and Fisheries", "Human Dimensions"],
  "uses_github_releases": false,
  "keywords": ["Risk Assessment Tool", "Shiny", "Web App", "Decision Support Tool", "Data Limited Method"]
}