{
  "associated_tools": [{"name":"ADMB","link":"https://www.admb-project.org"}],
  "authors": "Nitscke, P. and C. Legault",
  "background_text": "Incomplete or lack of age-specific catch and survey indices often limits the application of a full age-structured assessment (e.g. Virtual Population Analysis and many forward projecting age-structured models).  Stock assessments will often rely on the simpler size/age aggregated models (e.g. surplus production models) when age-specific information is lacking.  However the simpler size/age aggregated models may not utilize all of the available information for a stock assessment.  Knowledge of a species growth and lifespan, along with total catch data, size composition of the removals, recruitment indices and indices on numbers and size composition of the large fish in a survey can provide insights on population status using a simple model framework.  The Statistical Catch At LEngth (SCALE) model, previously known as the Length Tuned Model (LTM), is a forward projecting age-structured model tuned with total catch (mt), catch at length or proportional catch at length, recruitment at a specified age (usually estimated from first length mode in the survey), survey indices of abundance of the larger/older fish (usually adult fish) and the survey length frequency distributions.  The SCALE model was developed in the AD model builder framework.  The model parameter estimates are fishing mortality and recruitment in each year, fishing mortality to produce the initial population (Fstart), logistic selectivity parameters for each year or blocks of years and Qs for each survey index.  The SCALE model was developed as an age-structured model that does not rely on age-specific information on a yearly basis.  The model is designed to fit length information, abundance indices, and recruitment at age which can be estimated by using survey length slicing.  However the model does require an accurate representation of the average overall growth of the population which is input to the model as mean lengths at age.  Growth can be modeled as sex-specific growth and natural mortality or growth and natural mortality can be model with the sexes combined.  The SCALE model will allow for missing data.  The SCALE model can be used in two different ways.  First, the model can be used as a stock assessment tool for a species which has overall growth information, abundance indices at length, total removals, and size information of the catch but may not possess production ageing on a yearly basis.  Second, the model can be used as a diagnostic tool for comparison to other fully age-structured models that are tuned with age-specific data.  Failure of the SCALE model in fitting observed length information over time can provide insight on inaccuracies in the basic life history understanding of a population.  For example, if a SCALE model consistently predicts larger fish then were observed during a time period when fishing mortality if thought to be low then these results can suggest a possible overestimation in growth of the larger/older fish which intern may help explain the fully age-specific model results.  SCALE/LTM has been used as an exploratory assessment tool for Black Sea Bass (NEFSC), Spiny Dogfish (NEFSC), and Thorny skate (NEFSC).  SCALE was used for status determination in the Monkfish stock assessment.  The calculation engine was built using AD Model Builder by Paul Nitschke and Dr. Christopher M. Legault (currently at the NMFS Northeast Fisheries Science Center in Woods Hole, MA). The graphic interface was also developed at the NMFS Northeast Fisheries Science Center in Woods Hole, MA.",

  "documentation_link": "",
  "executable_link": "https://github.com/nmfs-fish-tools/SCALE/releases/download/1.0.11/SCALEV1.11.zip",
  "fit_repo": "https://github.com/nmfs-fish-tools/SCALE.git",
  "tool_abbreviation": "SCALE",
  "tool_name": "Statistical Catch at Length Model",
  "online_app_link": "",
  "pdf_download_link": "",
  "references": [
    "43rd Northeast Regional Stock Assessment Workshop (43rd SAW): 43rd SAW assessment summary report. US Dep. Commer., Northeast Fish. Sci. Cent. Ref. Doc. 06-14; 46 p.",
    "43rd Northeast Regional Stock Assessment Workshop (43rd SAW): 43rd SAW assessment report. US Dep Commer, Northeast Fish Sci Cent Ref Doc 06-25; 400 p.",
    "44th Northeast Regional Stock Assessment Workshop (44th SAW). 2007. 44th SAW assessment summary report. US Dep Commer, Northeast Fish Sci Cent Ref Doc. ",
    "44th Northeast Regional Stock Assessment Workshop (44th SAW): 44th SAW assessment report. US Dep Commer, Northeast Fish Sci Cent Ref Doc 07-10; 661 p.",
    "Northeast Data Poor Stocks Working Group. 2007. Monkfish assessment summary for 2007. US Dep Commer, Northeast Fish Sci Cent Ref Doc. 07-13; 12 p.",
    "Northeast Data Poor Stocks Working Group. 2007. Monkfish assessment report for 2007. US Dep Commer, Northeast Fish Sci Cent Ref Doc 07-21; 232 p."
  ],
  "software_badges":["https://www.repostatus.org/badges/latest/inactive.svg"],
    "active_development": false,
  "NOAA_internal": true,
  "version_number": "1.0.11",
  "release_badge":"nmfs-fish-tools/SCALE",
  "toolbox_drawers": ["fisheries"], 
  "keywords": ["Stock Assessment Model", "Length Structured Model", "ADMB", "Guided User Interface", "Legacy Tool"]
}