{
  "tool_name": "Vector Autoregressive Spatio-Temporal Model",
  "tool_abbreviation": "VAST",
  "website_link":"",
  "authors": "James T Thorson",
  "maintainer_name": "James Thorson",
  "maintainer_email": "james.thorson@noaa.gov",
  "background_text": "The Vector Autoregressive Spatio-Temporal (VAST) model assimilates biomass, count, and/or encounter/non-encounter data to estimate population density across space and time for multiple categories simultaneously.  Multivariate data arise in age/size-structured samples, multispecies models, and multi-modal sampling (e.g., combining stomach and bottom trawl samples).  Models can be specified with different levels of structure across time: no temporal structure (for index standardization), temporal autocorrelation (for forecasting and spatial allocation in unsampled years), or vector autocorrelation (to approximate species interactions).  Models can also be specified with different structure across categories: rank-reduced (for improved estimates of data-poor categories), or independent (to minimize assumptions). New data sets can be simulated based on estimated parameters, and simulated data can be re-analyzed to explore estimation performance (for alternative model specifications) or sampling design performance (when dropping subsets of data).  Results can be used to: generate abundance indices; generate age/length composition; conduct model selection, hypothesis testing, and cross-validation;  identify distribution shifts and range expansion/contraction; identify species assemblages having similar spatial, temporal, or spatio-temporal patterns; forecast and interpolate distribution under new environmental conditions; attribute changes to local or regional covariates; explore sampling or estimation performance using VAST as an operating model; inter-calibrate data from multiple survey gear and/or different measurement types; and estimate proportions of density within spatial substrata or belonging to individual categories.  ",
  "references": ["Please see up-to-date list of references on the VAST GitHub main-page: https://github.com/James-Thorson/VAST#references"],
  "online_app_link": "",
  "executable_link": "",
  "source_code_link": "https://github.com/James-Thorson-NOAA/VAST",
  "static_version_number": "3.2.0",
  "pdf_download_link": "",
  "active_development": true,
  "NOAA_internal": true,
  "documentation_link": "https://github.com/James-Thorson/VAST#user-resources-for-learning-about-vast",
  "associated_tools": [{"name":"VASTWestCoast","link":  "https://github.com/nwfsc-assess/VASTWestCoast"}, {"name":"VASTGAP"}],
  "software_badges":[ "https://img.shields.io/github/last-commit/James-Thorson-NOAA/VAST.svg?style=plastic",""],
  "release_badge":"James-Thorson-NOAA/VAST",
  "uses_github_releases": true,
  "toolbox_drawers": ["general", "fisheries"], 
  "keywords": ["Time Series", "Spatial Model", "TMB", "Species Distribution Model"]
}