{
  "associated_tools": [],
  "author_name": "Seaver, A.",
  "background_text": "The present version of ADAPT is a completely rewritten implementation of the age structured estimation model first introduced by Gavaris. We have incorporated features introduced by Conser, Mohn, and Restrepo in other versions of the ADAPT code. Population cohorts are estimated by a backward projection method that requires specification of a guess of the number of survivors in the last year and a decision rule for estimating the fishing mortality rate on the oldest age group in all remaining years. Catch is assumed to be measured without error. Backward projection can be based on either solution of the catch equation or by use of Pope’s approximation.  Population estimates are chosen so as to minimize the sum of squares difference between the population abundance and a set of one or more abundance indices. The IMSL implementation of the Levenburg-Marquardt method is used to solve the nonlinear least squares problem. Catchability coefficients are estimated as functions of population estimates and observed indices.  Bootstrapping is used to estimate the precision of all model parameters and all quantities that are functions of model parameters.  The graphical interface allows for model specification, importation of data sets, review of model results, and graphical display of model inputs and outputs. A comprehensive reference manual and context-sensitive help files are included. The calculation engine is written in FORTRAN using International Mathematics and Statistical Library functions for random number generation, optimization, matrix manipulation and sorting.  FACT 1.5 or 1.6 version input files will be automatically converted into the new format. Please refer to the help topic in the VPA application for more details about converting FACT input files.  WHAT files can not be converted directly. Please contact NFT support if you need to convert old WHAT input files.",

  "documentation_link": "",
  "download_app_link": "https://github.com/nmfs-fish-tools/VPA/releases/download/3.4.4/VPAV34.zip",
  "fit_repo": "https://github.com/nmfs-fish-tools/VPA.git",
  "tool_abbreviation": "VPA",
  "tool_name": "Virtual Population Analysis",
  "online_app_link": "",
  "pdf_download": "",
  "references": [
    "Collie, J. S. 1988 . Evaluation of virtual population analysis tuning procedures as applied to Atlantic bluefin tuna. Collect. Vol. Sci. Pap ICCAT, 28: 203-220.",
    "Conser, R. J. and J.E. Powers. 1989. Extensions of the ADAPT VPA tuning method designed to facilitate assessment work on tuna and swordfish stocks. ICCAT Working Doc. scrs/89/43. 15pp.",
    "Gavaris, S. 1988. An Adaptive framework for the estimation of population size. CAFSAC Res. Doc. 88/29. 12pp.",
    "Gavaris, S. 1993. Analytical estimates of reliability for the projected yield from commercial fisheries. Can Spec Pub Fish Aquat Sci 120: 185-191.",
    "Gulland, J. A. 1965. Estimation of mortality rates. Annex. to Arctic Fisheries Working Group Report. ICES CM 1965, doc. No 3. 9pp.",
    "Mohn, R.K. and R. Cook. 1993. Introduction to sequential population analysis. NAFO Sci. Counc. Studies #17 110pp.",
    "Parrack, M. L. 1986. A method of analyzing catches and abundance indices from a fishery. ICCAT Coll. Vol. Sci. Papers 24: 209-221.",
    "Patterson K.R. and G.P. Kirkwood. 1995. Comparative performance of Adapt and Laurec-Shepherd methods for estimating fish population parameters and in stock management. ICES Journal of Marine Science 52 (2): 183-196.",
    "Pope J. G. 1972. An investigation of the accuracy of virtual population analysis using cohort analysis. ICNAF Res. Bull. 9:65-74."
  ],
  "shields_badges":["https://www.repostatus.org/badges/latest/inactive.svg"],
    "active_development": false,
  "NOAA_internal": true,
  "version_number": "3.4.4",
  "release_badge":"nmfs-fish-tools/VPA",
  "toolbox_drawer": ["fisheries"], 
  "keywords": ["Virtual Population Analysis", "Stock Assessment Model", "Guided User Interface", "Legacy Tool"]
}
