{
  "associated_tools": [],
  "authors": "Seaver, A.",
  "maintainer_name": "orphaned", 
  "maintainer_email": "fisheries.toolbox@noaa.gov",
  "background_text": "Visual Report Designer is a tool that can be used to visually depict trends in tabular data. It is well suited to facilitate the evaluation of data relating to stock status and in the communication of information from noncommensurate quantities.  The Visual Report Designer translates the information in a numerical data range to a set of color-coded symbols.  Observations can be sorted and grouped into quantiles, with each quantile assigned a color-coded symbol. Comparison tables can be constructed using a 5-category (quintile) color scheme in a two hues of varying lightness style similar to 'Consumer Reports' comparison tables, or into a 2- or 3-category color scheme similar to traffic light charts.  If desired, a measure of dispersion (Max-Min)/Mean can be displayed next to the comparison table. This property can help focus attention on quantities with a wide dynamic range and reduce attention on quantities with little variation.  Data can be imported into a Visual Report Designer project are stored in a master compilation called a data collection. From this master dataset you can construct up to 15 reports, each of which is automatically saved with the project data . Reports can be edited at a future date if necessary.  The current version of Visual Report Designer allows you to import time series data directly from several NOAA Fisheries Toolbox models: AGEPRO, AIM, ASAP, ASPIC, CSA, and VPA / ADAPT, as well as SAGA length-weight files. This can be useful, for example, in comparing and contrasting results from different Toolbox models. For more information on the versions supported, and which types of data can be imported, see the help manual.  You can also import time-series data stored in text files, spreadsheets or other applications by copying the data to the Windows clipboard and adding it to Visual Report Designer's data collection.  Any changes you make to the project are recorded into a log file. Visual Report Designer automatically saves the project data and reports as you make changes. To help prevent accidental loss of data, Visual Report Designer also includes an automatic backup feature and the ability to restore projects from a backup copy.  Visual Report Designer saves the report in an HTML file, a format that web browsers and many applications can read. You can view the report file from within the Visual Report Designer application or you can select another application. You can also open the report with a word processing program and make minor edits. If the report is viewed from within Visual Report Designer, you can save an image of the report as a Bitmap image file, or copy it to the Windows clipboard so that it can be pasted into another application.  Other Uses of the Visual Report Designer  Visual Report Designer automatically saves the imported time series data in a comma delimited (CSV) file. It can also be saved in a database style format. The data files can be a useful way to analyze the results of many different Toolbox models outside of Visual Report Designer without having to convert between data formats by hand.  Notes: Please note that Visual Report Designer uses a Microsoft Internet Explorer component as a helper tool to view report files. For computer safety reasons, the installation package doesn't contain this helper component but most Windows computers will already have Microsoft Internet Explorer installed. You can always use Visual Report Designer without the Internet Explorer component if you wish, although some features may not be fully available.",
  "documentation_link": "",
  "executable_link": "https://github.com/nmfs-fish-tools/VRD/releases/download/1.6.1/VisualReportV161.zip",
  "fit_repo": "https://github.com/nmfs-fish-tools/VRD.git",
  "tool_abbreviation": "VRD",
  "tool_name": "Visual Report Designer",
  "online_app_link": "",
  "pdf_download_link": "",
  "references": [],
  "software_badges":["https://www.repostatus.org/badges/latest/inactive.svg"],
  "supprt_level": "internal_inactive",
  "static_version_number": "1.6.1",
  "uses_github_releases": true,
  "release_badge":"nmfs-fish-tools/VRD",
  "toolbox_drawers": ["fisheries"], 
  "keywords": ["Guided User Interface", "User Utilities", "Legacy Tool"]
}