{
  "associated_tools": [
    {
      "name": "Template Model Builder",
       "link": "https://github.com/kaskr/adcomp"  
    }
  ],
  "authors": "Tim Miller and Brian Stock",
  "maintainer_name":"Tim Miller",
  "maintainer_email": "timothy.j.miller@noaa.gov",
  "background_text": "A state-space age-structured assessment model that can include state-space covariate models and effects on recruitment and internal estimation of biological reference points. See the vignettes provided with the package for example applications.",
  "source_code_link": "https://github.com/timjmiller/wham",
  "tool_abbreviation": "WHAM",
  "website_link": "https://timjmiller.github.io/wham",
  "tool_name": "Woods Hole Assessment Model",
  "references": [
    "Miller, T. J., Hare, J. A., and Alade, L. A. 2016. A state-space approach to incorporating environmental effects on recruitment in an age-structured assessment model with an application to Southern New England yellowtail flounder. Canadian Journal of Fisheries and Aquatic Sciences 73(8): 1261-1270. doi: 10.1139/cjfas-2015-0339",
    "Miller, T. J. and Hyun, S-Y. 2018. Evaluating evidence for alternative natural mortality and process error assumptions using a state-space, age-structured assessment model. Canadian Journal of Fisheries and Aquatic Sciences 75(5): 691-703. doi: 10.1139/cjfas-2017-0035",
    "Miller, T. J., O’Brien, L., and Fratantoni, P. S. 2018. Temporal and environmental variation in growth and maturity and effects on management reference points of Georges Bank Atlantic cod. Canadian Journal of Fisheries and Aquatic Sciences 75(12): 2159-2171. doi: 10.1139/cjfas-2017-0124"
  ],
  "release_badge": "timjmiller/wham",
  "software_badges":[
    {
      "link": "https://www.repostatus.org/badges/latest/active.svg", 
      "alt_text": "A software badge showing that the repository is active."
    }
  ],
    "active_development": true,
  "noaa_internal": true,
  "uses_github_releases": true,
  "toolbox_drawers": ["Fish and Fisheries"], 
  "keywords": ["Stock Assessment Model", "Age Structured Model", "TMB", "R Package", "Management Strategy Evaluation"]
}