{
  "authors": "Seaver, A.",
  "maintainer_name": "orphaned", 
  "maintainer_email": "fisheries.toolbox@noaa.gov",
  "background_text": "Yield per Recruit (YPR) is a major revision of earlier implementations of the basic Thompson-Bell model for estimating the expected lifetime yield and biomass from a cohort subjected to varying levels of fishing mortality.  The present version estimates life-history parameters such as mean age, mean generation time, and expected number of spawnings.  In addition the user can investigate the resulting age composition of catch and abundance under different levels of fishing mortality.  The latest version of YPR allows the user to incorporate uncertainty in weights at age, natural mortality, maturity, and fishery selectivity.  The user can optionally enter the coefficients of either a Beverton-Holt or Ricker stock recruitment relationship and perform a Sissenwine-Shepherd analysis for equilibrium estimates of maximum sustainable yield (MSY) reference points (FMSY and BMSY).  The user can also conduct sensitivity analyses for any model parameter. Data visualization methods are emphasized to allow exploration of the population consequences of changes in fishing mortality.",
  "executable_link": "https://github.com/nmfs-fish-tools/YPR/releases/download/3.3.0/YPRV33.zip",
  "tool_abbreviation": "YPR",
  "tool_name": "Yield Per Recruit",
  "references": [
    "Gabriel, W.L., M. P. Sissenwine, and W. J. Overholtz. 1989. Analysis of spawning stock biomass per recruit: An example of Georges Bank haddock. North American Journal of Fisheries Management 9:383-391, 1989.",
    "Thompson, W.F. and F.H Bell. 1934. Biological statistics of the Pacific halibut fishery. (2) Effects of changes in intensity upon total yield and yield per unit of gear. International Fisheries Commission Report, No. 8, 1934."
  ],
  "software_badges":["https://www.repostatus.org/badges/latest/inactive.svg"],
  "active_development": false,
  "noaa_internal": true,
  "static_version_number": "3.3",
  "uses_github_releases": false,
  "release_badge":"nmfs-fish-tools/YPR",
  "toolbox_drawers": ["fisheries"], 
  "keywords": ["Reference Points Model", "Stock Assessment Tool", "Legacy Tool", "Visualization"]
}
